package ir.aliyas.exm1

import android.annotation.SuppressLint
import android.content.Intent
import android.content.res.ColorStateList
import android.graphics.Color
import android.os.Bundle
import android.os.CountDownTimer
import android.view.LayoutInflater
import android.widget.*
import androidx.appcompat.app.AlertDialog
import androidx.appcompat.app.AppCompatActivity
import androidx.core.content.ContextCompat
import ir.aliyas.exm1.databinding.ActivityPlay2Binding
import ir.aliyas.exm1.databinding.ActivityPlayBinding
import java.util.*
import java.util.concurrent.TimeUnit


class PlayActivity2 : AppCompatActivity() {
   private lateinit var activityPlay2Binding: ActivityPlay2Binding

    //    timer
    private var countDownTimer: CountDownTimer? = null
    private val countDownInMilliSecond: Long = 60000
    private val countDownInterval: Long = 1000
    private var timeLeftMilliSeconds: Long = 0
    private var defaultColor: ColorStateList? = null
    private var score = 0
    private var correct = 0
    private var wrong = 0
    private var skip = 0
    private var qIndex = 0
    private var updateQueNo = 1



    // create string for question, answer and option

    var questions = arrayOf(
        "1- كدام عبارت نادرست است؟",
        "2- در خصوص انقباض طوالنیِ عضلۀ سهسر بازو، كدام مورد به طور حتم درست است؟",
        "3- در ارتباط با انسان، كدام مورد عبارت زير را به طور مناسب كامل میكند؟ \n" +
                "»هر استخوان ............... با نوعی استخوان ............... و نوعی استخوان ............... مفصل متحرک تشكيل میدهد.«",
        "4- كدام مورد دربارۀ پرندگان درست است؟",
        "5- كدام عبارت درست است؟",
        "6- كدام مورد برای تكميل عبارت زير مناسب است؟ \n" +
                "< مطابق با متن كتاب درسی، در ............... سطح سازمانيابی حيات، .................. .>",
        "7- در گياه زنبق، با فرض اينكه ژننمود (ژنوتيپ) درون دانه AAB است، كدام مورد دربارۀ ژننمود ياختۀ سازندۀ دانۀ گردۀ نارس و ياختۀ بافت خورش \n" +
                "ممكن است؟",
        "8- کدام مورد ، برای تکمیل عبارت زیر مناسب است؟ \n" +
                "»در گیاه تک لپه ................... گیاه دو لپه ................... «",
        "9- در مطالعۀ دو بیماری هموفیلی و کم خونی داسیشکل، با فرض این که مادر خالص و فقط یکی از والدین بیمار باشد، در شرایط معمول، تولد کدام فرزند \n" +
                "برای همۀ حاالت ممکن است؟\n",
        "10- در خصوص همۀ یاخته هایی که در پایان تقسیم کاستمان (میوز) در یک گل دوجنسی ایجاد میشوند. کدام عبارت درست است؟\n",
        "11- کدام مورد، برای تکمی ل عبارت زیر نامناسب است؟ \n" +
                "< به طور معمول، بخش ی از کلیۀ انسان در نزدیکی ................... است که ................... > ",
        "12- کدام مورد برا ی تکمیل عبارت زیر مناسب است؟ \n" +
                "< ترشحات بزرگترین غدۀ بزاقی انسان، ................... >",
        "13- کدام مورد، برای تکمی ل عبارت زیر مناسب است؟ \n" +
                "< نوعی تنظیمکنندۀ رشد گ یاه ی میتواند عالوه بر تولید میوه های بدون دانه، در شرایطی از تشکیل الیۀ جداکنندۀ برگ ممانعت به عمل آورد. این \n" +
                "تنظیم کنندۀ رشد ، ................... >",
        "14- کدام عبارت، درباره شبکۀ هادی قلب یک فرد سالم نادرست است؟",
        "15- کدام مورد، برای تکمی ل عبارت زیر مناسب است؟ \n" +
                "< در نوعی جانور بیمهره، آبشش ها به نواحی خاصی محدود میشوند. در ای ن جانور ، ................... >",
        "16- کدام مورد، عبارت زیر را به طور مناسب کامل میکند؟ \n" +
                "< در مولکول انسولین، همانند مولکول ................... > ",
        "17- کدام مورد ، برای تکمیل عبارت زیر نامناسب است؟ \n" +
                "< به طور معمول، هر گیاهی که برای ................... نیازمند است، ................... دارد >",
        "18- کدام مورد، برای تکمی ل عبارت زیر مناسب است؟ \n" +
                "< طاووس نر ................... نوعی جیرجی رک نر )مطرحشده در کتاب درسی( ...................>",
        "19- مطابق با مطلب کتاب درسی، نوعی جانور بی مهره با بروز رفتاری خاص، به جای انتقال ژن خود به نسل آینده، به موفقیت تولیدمثلی خویشاوندان خود \n" +
                "کمک می کند. کدام ویژگی درباره ای ن جانور، صادق است؟",
        "20- کدام مورد، به طور حتم مربوط به تنظیم بیان ژن پیش از رونویسی است؟",
        "21- کدام عبارت، مقایسۀ صحیحی بین تومور خوشخیم و بدخیم را بیان میکند؟",
        "22- کدام مورد، وجه مشترک هر دو نوع تنظیم مثبت و منفی رونویسی در باکتری اشرشیاکالی محسوب نمیشود؟",
        "23- کدام گزینه، برای تکمیل عبارت زیر، نامناسب است؟ \n" +
                "< در واحدهای تکراری تارچۀ یک عضله دلتایی، رشتههایی متشکل از اجزای کروی شکل وجود دارد. این رشتهها در هنگام ...............>",
        "24- کدام گزینه، عبارت زیر را به درستی تکمیل میکند؟ \n" +
                "< نوعی هورمون گیاهی که ...............> ",
        "25- مطابق با مطلب کتاب درسی، در یک منطقۀ ماالریاخیز، مادر خانواده به سبب شکل گویچههای قرمز خود، در معرض خطر ابتال به بیماری ماالریا قرار \n" +
                "دارد، در حالی که پدر نسبت به این بیماری مقاوم است. تولد کدام فرزند در این خانواده ممکن است؟ ",
        "26- کدام گزینه، برای تکمیل عبارت زیر، نامناسب است؟ \n" +
                "< در صورت ابتالی پسری بالغ به پرکاری غدۀ ............... بیشتر میشود و در صورت ابتالی پسر بالغ دیگری به کمکاری این غده ............... افزایش خواهد \n" +
                "یافت.> ",
        "27- کدام عبارت درست است؟ ",
        "28- کدام عبارت، با توجه به عوامل مؤثر بر جمعیت نادرست است؟",
        "29- به طور معمول، کدام گزینه درست است؟",
        "30- کدام عبارت، دربارۀ هر نوکلئوتید موجود در بدن یک فرد سالم درست است؟"






    )
    private var answer = arrayOf(
        "افرادی كه توانایی بقای جمعيت را در شرایط محيطی جدید باال بردهاند، به طور حتم، حاصل فرایند نوتركيبی یا جهش هستند",
        "با دخالت نوعی تركيب فسفاتدار، تغييری در ساختار مولكول ميوزین ایجاد میشود.",
        "ساعد ـ دراز ـ كوتاه",
        "همۀ كيسههای هوادار عقبی همانند اغلب كيسههای هوادار جلویی، به صورت جفت وجود دارند. ",
        "هر زنبور عسل كارگر، با استفاده از فرومون با سایر افراد گروه ارتباط برقرار میكند.\n",
        "ششمين ـ مجموع همۀ دگره (الل) های افراد یک جمعيت، میتواند مورد بررسی قرار گيرد",
        "AB,BB",
        "برخالف ـ در یاختههای غالف آوندی برگ، سبزدیسه )کلروپالست (های فراوان ی وجود دارد. ",
        "دختر سالم و ناخالص",
        "توسط یاختههایی با دو مجموعه فامتن (کروموزوم) احاطه شدهاند.",
        "ماهیچهها یی ـ مواد غذایی بلعشده را به درون بخش کیسهایشکل لول ۀ گوارش وارد میکند.",
        "توسط مجرایی در نزدیکی دندانهای فک باال خارج میشود",
        "میتواند تولید نوعی هورمون بازدارنده را در جوانه های جانبی ساقه تحر یک کند.\n",
        "دسته تارهای تخصصی افتۀ دهلیزی، ابتدا در سراسر د یوارۀ دهلیز گسترش میی ابد.",
        "مواد دفعی ن یتروژندار از طری ق عضو ویژۀ تنفسی دفع میشود.\n",
        " هموگلوبین، رشته پلی پپتیدی ساختار فشرده و نامتقارن ی به خود می گیرد.",
        "تولیدمثل به ی اختههای جنسی شناگر ـ به تعداد برچهها در داخل تخمدان، فضا ",
        "همانند ـ نسبت به جانور ماده، هزین ۀ کمتری در تولی د مثل میپردازد.",
        "دو رشتۀ تشکیل دهند ۀ طناب عصبی آن در نقاطی به هم اتصال دارند.\n",
        "تغییر در فشردگی واحدهای تکراری در رشتۀ کروماتین",
        "تومور خوشخیم برخالف بدخیم، نمیتواند از منافذ رگهای لنفی عبور کند.  ",
        "هر پروتئینی که به نواحی خاصی از راهانداز متصل میشود، رنابسپاراز را به محل راهانداز هدایت میکند.",
        "استراحت، از طریق سرهای خود، از نوعی رشتههای پروتئینی جدا میگردند. ",
        " از جوانۀ رأسی به جوانههای جانبی میرود، باعث انجام یکی از روشهای تکثیر رویشی در گیاهان میشود. ",
        " پسری در معرض خطر ابتال به بیماری ماالریا و دارای گویچههای قرمز کامالً طبیعی ",
        " تیروئید، میزان ترشح انسولین ـ دمای بدن \n",
        "جهش حذف همانند جهش بیمعنا، به تغییر پلیپپتید ساخته شده میانجامد.",
        "عاملی که باعث شبیهشدن خزانۀ ژنی دو جمعیت میشود، در اغلب موارد، تعادل ژنی را در جمعیتها برقرار میکند.",
        " هر گیاهی که گل دو جنسی و گلبرگهای جدا از هم دارد، دانههای گردهای با دیوارۀ متخلخل تولید میکند.",
        "در ساختار خود گروه یا گروههای فسفات دارد."




    )
    private var options = arrayOf(
        "جانورانی كه با انتخاب جفت، موفقيت توليدمثلی خود را تضمين میكنند، به طور حتم، فراوانی دگرهای اللی جمعيت را تغيير میدهند. ",
        "افرادی كه توانایی بقای جمعيت را در شرایط محيطی جدید باال بردهاند، به طور حتم، حاصل فرایند نوتركيبی یا جهش هستند",
        "افرادی كه در مادۀ ژنتيكی آنها، تغيير ماندگاری ایجاد شده است، به طور حتم، تحت تأثير انتخاب طبيعی قرار میگيرند.",
        "جانورانی كه جابهجایی طوالنیمدت و رفت و برگشتی دارند، به طور حتم، تحت تأثير یادگيری قرار گرفتهاند.",
        "همۀ سرهای ميوزین یک ساركومر، در یک جهت حركت میكنند.",
        "گلوكز یا كرآتين فسفات به عنوان منبع تأمين انرژی به مصرف میرسد.\n",
        "با دخالت نوعی تركيب فسفاتدار، تغييری در ساختار مولكول ميوزین ایجاد میشود.",
        "مولكولهای پروتئين پس از صرف انرژی، یونهای كلسيم را به مادۀ زمينهای سيتوپالسم تار عضالنی وارد مینمایند.",
        "دنده ـ پهن ـ نامنظم",
        "ساق پا ـ كوتاه ـ دراز ",
        "ساعد ـ دراز ـ كوتاه",
        "نيم لگن ـ دراز ـ نامنظم ",
        "همۀ كيسههای هوادار عقبی همانند اغلب كيسههای هوادار جلویی، به صورت جفت وجود دارند.",
        "همۀ كيسههای هوادار جلویی همانند اغلب كيسههای هوادار عقبی، در محل دو شاخه شدن نای قرار دارند.",
        "همۀ كيسههای هوادار عقبی همانند همۀ كيسههای هوادار جلویی، در تبادل گازهای تنفسی نقش اصلی را دارند",
        "همۀ كيسه های هوادار جلویی همانند همۀ كيسه های هوادار عقبی، پس از حركات ميانبند دیافراگم  تغيير حجم میدهند.",
        "هر زنبور عسل كارگر، به دنبال دو برابر شدن فام تن  كروموزوم های موجود در تخمک ملكه به وجود میآید.",
        "هر مورچۀ برگبر كارگر، از قطعات برگ برای تغذیۀ خود یا سایر افراد گروه استفاده میكند.",
        "هر زنبور عسل كارگر، با استفاده از فرومون با سایر افراد گروه ارتباط برقرار میكند.\n",
        "هر مورچۀ برگبر كارگر، وظيفۀ دفاع از برگ برشیافته را بر عهده دارد.",
        "ششمين ـ مجموع همۀ دگره (الل) های افراد یک جمعيت، میتواند مورد بررسی قرار گيرد ",
        "چهارمين ـ عوامل غيرزندۀ محيط میتوانند تغييری در مادۀ ژنتيكی فرد ایجاد كنند",
        "هفتمين ـ از اجتماع چند بومسازگان، زیستبوم معنا پيدا میكند ",
        "پنجمين ـ جمعيت های گوناگون با هم در تعامل هستند ",
        "AB,AA",
        "AB,BB",
        "BB,AA",
        "BB,AB",
        "همانند ـ آوندهای آبکش رو به روپوست رویی و آوندهای چوب ی رو به روپوست زی ری ن پهنک برگ قرار دارند. ",
        "برخالف ـ در یاختههای غالف آوندی برگ، سبزدیسه )کلروپالست (های فراوان ی وجود دارد. ",
        " برخالف ـ میانبرگ از دو نوع یاختۀ پارانشیمی نرمآکنهای  تشکیل شده است",
        "همانند ـ تعداد روزنه ها در سطح زبر ی ن برگ ب یش از سطح زی ری ن آن است.\n",
        " دختر بیمار",
        "دختر سالم و ناخالص",
        "پسر بیمار",
        "پسر سالم و خالص",
        "توسط یاختههایی با دو مجموعه فامتن (کروموزوم) احاطه شدهاند.",
        "در بخش متورم گل، مراحل تما یز و تکامل خود را آغاز میکنند.",
        "ی ک یا چند تقسیم رشتمان (میتوز) انجام میدهند.\n",
        "دیوارۀ خارجی و د یوار ۀ داخلی دارند. ",
        "غدهای ـ ضربان قلب و فشار خون را افزای ش میدهد.",
        "اندامی ـ آنزیمهای گوارشی و ب یکربنات تولید میکند",
        " اندامی ـ به از ب ین بردن میکروبهای ب یماری زا و یاختههای سرطان ی کمک می کند.",
        "ماهیچهها یی ـ مواد غذایی بلعشده را به درون بخش کیسهایشکل لول ۀ گوارش وارد میکند.",
        "توسط باالتر ین بخشِ ساق ۀ مغز تنظیم میشود.",
        "همواره تحت تأثیر ی ک محرک طبیعی تحری ک میشود.",
        "ابتدا از طر یق مجرای بزاقی به زیر زبان تخلیه میشود.",
        "توسط مجرایی در نزدیکی دندانهای فک باال خارج میشود",
        "مانع رویش دانه و رشد جوانهها در شرایط نامساعد محیط میشود. ",
        "همواره مانع تبدیل مریستم رو یشی به مریستم ز ایشی ساقه میشود.\n",
        " میتواند تولید نوعی هورمون بازدارنده را در جوانههای جانبی ساقه تحر یک کند.\n",
        "همواره در مقاد یر زی اد و در حضور مقادیر اندکی از نوعی هورمون محرک رشد، باعث ساق هزا یی میشود.",
        " دسته تارهای تخصصی افتۀ دهلیزی، ابتدا در سراسر د یوارۀ دهلیز گسترش میی ابد.",
        "جر یان الکتریکی از طر یق سه مسیر ب ین گرهی، به گر ۀ دهلیزی بطنی منتقل میشود.",
        "دسته تارهای ماهیچهای تخصصیافته، پس از گرۀ دهلیزی بطنی به دو شاخه تقسیم میشود.",
        "جر یان الکتریکی توسط یک دسته تار عضالن ی تخصصی افته از گرۀ سینوسی دهلیزی به دهلیز چپ هدا یت میشود.\n",
        "انشعابات حفرۀ گوارشی به تمام نواح ی بدن نفوذ میکند.",
        "نوعی سازوکار تهو یهای، تبادالت گازی را ممکن میسازد. ",
        "مواد دفعی ن یتروژندار از طری ق عضو ویژۀ تنفسی دفع میشود.\n",
        "رشته های عصبی با یاخته های مژکدار خط جانبی تماس دارند",
        " هموگلوبین، رشته پلی پپتیدی ساختار فشرده و نامتقارن ی به خود میگیرد.",
        "هموگلوبین، زنجیره های پلی پپتیدی یکسان در کنار یکد یگر قرار میگیرند. ",
        " میوگلوبین، همۀ گروههای R آمینواس یدهای آبگر یز در بخش ب یرون ی ساختار قرار میگیرند.",
        " میوگلوبین، با شکسته شدن هر نوع پیوند شیمیایی، همۀ سطوح ساختاری پروتئین تغییر می یابد.\n",
        "بقا به زمین ساقه ـ سامانه ای برای ترابری مواد",
        "گرده افشان ی به حشرات ـ در تشکیل برگهای رویا نی نقش ",
        "تکثیر به ی اختۀ دوهستهای ـ یاختهها ی مرده و دوکی شکل و دراز ",
        "تولیدمثل به ی اختههای جنسی شناگر ـ به تعداد برچهها در داخل تخمدان، فضا ",
        "برخالف ـ برای انتخاب شدن رقابت میکند",
        "برخالف ـ در موفقیت تولید مثلی نقش مؤثری دارد.",
        "همانند ـ برای جلب جفت وی ژگیهای ظاهری خاصی پیدا میکند. ",
        "همانند ـ نسبت به جانور ماده، هزین ۀ کمتری در تولی د مثل میپردازد.",
        "دو رشت ۀ تشکیل دهند ۀ طناب عصب ی آن در نقاطی به هم اتصال دارند.\n",
        "سامانۀ دفعی آن، از طریق منفذی مستقیماً به محیط بیرون باز و دفع از طریق آن انجام می شود. ",
        "به واسط ۀ مای عی که در هر انشعاب ساختار تنفسی آن موجود است، تبادالت گازی ممکن میگردد.",
        "گرۀ عصبی هر بند آن، دارای اعصاب ی است که به طرف اندام های حرکت ی و اندامهای داخل ی ادامه می یابد.\n",
        "میزان دسترسی پیشماده به آنزیم",
        "اتصال رناهای کوچک به نوعی ریبونوکلئیک اسید",
        " تغییر در فشردگی واحدهای تکراری در رشتۀ کروماتین",
        " افزایش طول عمر مولکول میانجی دنا (DNA (و رناتن )ریبوزوم( ",
        "تومور خوشخیم برخالف بدخیم، نمیتواند از منافذ رگهای لنفی عبور کند. ",
        "نوع بدخیم برخالف خوشخیم، در پی اختالل در فعالیت بعضی از ژنها ایجاد میشود.",
        "تومور بدخیم برخالف خوشخیم، میتواند در انجام اعمال طبیعی اندام اختالل ایجاد کند.",
        "نوع خوشخیم بر خالف بدخیم، نمیتواند آنقدر بزرگ شود که به بافتهای مجاور خود آسیب بزند. ",
        "هر پروتئینی که به نواحی خاصی از راهانداز متصل میشود، رنابسپاراز را به محل راهانداز هدایت میکند.",
        "هر پروتئینی که به نوعی قند دیساکاریدی اتصال مییابد، بر فعالیت آنزیم رونویسیکننده تأثیر میگذارد.",
        "هر پروتئینی که بر روی تولی خاصی از DNA قرار میگیرد، ژن یا ژنهای آن توسط یک نوع رنابسپاراز، رونویسی شدهاند",
        "هر پروتئینی که ژنهای مربوط به تجزیۀ نوعی قند را رونویسی میکند، به کمک توالیهای ویژهای در دنا (DNA (، جایگاه آغاز رونویسی ژنها را شناسایی میکند.\n",
        "انقباض، از وسعت نوار روشن میکاهند",
        "استراحت، در بخشی از نوار تیره یافت میشوند.",
        "انقباض، به رشتههای مشابه خود نزدیک میشوند.",
        "استراحت، از طریق سرهای خود، از نوعی رشتههای پروتئینی جدا میگردند. ",
        " در کشاورزی به عنوان علفکش استفاده میشود، از سوختهای فسیلی نیز آزاد میگردد",
        " برای تولید میوههای بدون دانه به کار میرود، در شرایط نامساعد نیز به حفظ آب گیاه کمک میکند. ",
        "از جوانۀ رأسی به جوانههای جانبی میرود، باعث انجام یکی از روشهای تکثیر رویشی در گیاهان میشود.",
        "در شرایط نامساعد مانع تولید و رهاشدن آمیالز در جوانههای غالت میشود، در بافتهای آسیبدیده نیز افزایش مییابد.",
        "دختری تماماً دارای گویچه های قرمز طبیعی و مقاوم نسبت به بیماری ماالریا ",
        " پسری در معرض خطر ابتال به بیماری ماالریا و دارای گویچههای قرمز کامالً طبیعی ",
        " دختری در معرض خطر مرگ و میر در سنین پایین و دارای گویچههای قرمز کامالً غیرطبیعی\n",
        " پسری تماماً دارای گویچه های قرمز غیرطبیعی و بسیار حساس نسبت به کمبود اکسیژن محیط",
        "تیروئید، میزان ترشح انسولین ـ دمای بدن ",
        "پاراتیروئید، احتمال بیماری قلبی ـ احتمال مشکالت تنفسی",
        " فوق کلیه، احتمال ابتال به بیماریهای عفونی ـ احتمال اختالالت تولیدمثلی ",
        "ترشحکنندۀ هورمون رشد، تولیدیاختههای جدید استخوانی ـ شکنندگی استخوانها ",
        "جهش دگرمعنا برخالف جهش بیمعنا، به تغییر محصول حاصل از رونویسی میانجامد. ",
        " جهش دگرمعنا همانند جهش خاموش، به تغییر تعداد نوکلئوتیدهای ژن میانجامد",
        "جهش حذف همانند جهش بیمعنا، به تغییر پلیپپتید ساخته شده میانجامد.",
        "جهش خاموش برخالف جهش حذف، منجر به تغییر در نوع آمینواسید میشود",
        "عاملی که افراد سازگارتر با محیط را برمیگزیند، به طور حتم، بر تغیر ژنوتیپ فرد بیتاثیر است. ",
        "عاملی که خزانۀ ژنی جمعیت را غنیتر میسازد، میتواند در شرایطی توان بقای جمعیت را افزایش دهد.",
        "عاملی که باعث شبیهشدن خزانۀ ژنی دو جمعیت میشود، در اغلب موارد، تعادل ژنی را در جمعیتها برقرار میکند.",
        "عاملی که باعث تغییر فراوانی دگرهای )اللی( جمعیت بر اثر رویدادهای تصادفی میشود، به طور حتم، در جمعیتهای کوچک تأثیر بیشتری میگذارد.",
        " هر گیاهی که گل دو جنسی و گلبرگهای جدا از هم دارد، دانههای گردهای با دیوارۀ متخلخل تولید میکند.",
        "هر گیاهی که برای گلدادن به گذراندن یک دوره سرما نیاز دارد، در سال دوم، رشد رویشی و زایشی مینماید.\n",
        " هر گیاهی که غیرچوبی و چندساله میباشد، گلهایی کامالً وابسته به باد برای گردهافشانی تولید میکند. ",
        "هر گیاهی که توانایی تولید دانهای با رویش زیرزمینی دارد، در وسط ریشه، فاقد بافت پارانشیمی است.\n",
        " نوعی باز آلی با ساختار حلقهای دارد که به ریبوز متصل است.",
        "واحد تکرارشوندۀ نوعی بسپار )پلیمر( محسوب میشود.",
        "در طی مرحلۀ هوازی تنفس یاختهای تولید میگردد. ",
        "در ساختار خود گروه یا گروههای فسفات دارد."















    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        activityPlay2Binding = ActivityPlay2Binding.inflate(layoutInflater)
        setContentView(activityPlay2Binding.root)
        setSupportActionBar(activityPlay2Binding.toolbarmain)
        initViews()

    }

    @SuppressLint("SetTextI18n")
    private fun showNextQuestion() {
        checkAnswer()
        activityPlay2Binding.apply {
            if (updateQueNo < 30) {
                tvNoOfQues.text = "${updateQueNo + 1}/30"
                updateQueNo++
            }
            if (qIndex <= questions.size - 1) {
                tvQuestion.text = questions[qIndex]
                radioButton1.text = options[qIndex * 4] // 2*4=8
                radioButton2.text = options[qIndex * 4 + 1] //  2*4+1=9
                radioButton3.text = options[qIndex * 4 + 2] //  2*4+2=10
                radioButton4.text = options[qIndex * 4 + 3] //  2*4+3=11
            } else {
                score = correct
                val intent9 = Intent(this@PlayActivity2, ResultActivity2::class.java)
                intent9.putExtra("درست", correct)
                intent9.putExtra("نادرست", wrong)
                intent9.putExtra("skip", skip)
                startActivity(intent9)
                finish()
            }
            radiogrp.clearCheck()
        }
    }

    @SuppressLint("SetTextI18n")
    private fun checkAnswer() {
        activityPlay2Binding.apply {
            if (radiogrp.checkedRadioButtonId == -1) {
                skip++
                timeOverAlertDialog()
            } else {
                val checkRadioButton =
                    findViewById<RadioButton>(radiogrp.checkedRadioButtonId)
                val checkAnswer = checkRadioButton.text.toString()
                if (checkAnswer == answer[qIndex]) {
                    correct++
                    txtPlayScore.text = "امتیاز : $correct"
                    correctAlertDialog()
                    countDownTimer?.cancel()
                } else {
                    wrong++
                    wrongAlertDialog()
                    countDownTimer?.cancel()
                }
            }
            qIndex++
        }
    }

    @SuppressLint("SetTextI18n")
    private fun initViews() {
        activityPlay2Binding.apply {
            tvQuestion.text = questions[qIndex]
            radioButton1.text = options[0]
            radioButton2.text = options[1]
            radioButton3.text = options[2]
            radioButton4.text = options[3]

            nextQuestionBtn.setOnClickListener {
                if (radiogrp.checkedRadioButtonId == -1) {
                    Toast.makeText(
                        this@PlayActivity2,
                        "جوابی را انتخاب کنید",
                        Toast.LENGTH_SHORT
                    )
                        .show()
                } else {
                    showNextQuestion()
                }
            }
            tvNoOfQues.text = "$updateQueNo/30"
            tvQuestion.text = questions[qIndex]
            defaultColor = quizTimer.textColors
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
        }
    }

    private fun statCountDownTimer() {
        countDownTimer = object : CountDownTimer(timeLeftMilliSeconds, countDownInterval) {
            override fun onTick(millisUntilFinished: Long) {
                activityPlay2Binding.apply {
                    timeLeftMilliSeconds = millisUntilFinished
                    val second = TimeUnit.MILLISECONDS.toSeconds(timeLeftMilliSeconds).toInt()
                    // %02d format the integer with 2 digit
                    val timer = String.format(Locale.getDefault(), "زمان: %02d", second)
                    quizTimer.text = timer
                    if (timeLeftMilliSeconds < 10000) {
                        quizTimer.setTextColor(Color.RED)
                    } else {
                        quizTimer.setTextColor(defaultColor)
                    }
                }
            }

            override fun onFinish() {
                showNextQuestion()
            }
        }.start()
    }

    @SuppressLint("SetTextI18n")
    private fun correctAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity2)
        val view = LayoutInflater.from(this@PlayActivity2).inflate(R.layout.correct_answer, null)
        builder.setView(view)
        val tvScore = view.findViewById<TextView>(R.id.tvDialog_score)
        val correctOkBtn = view.findViewById<Button>(R.id.correct_ok)
        tvScore.text = "امتیاز : $correct"
        val alertDialog = builder.create()
        correctOkBtn.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun wrongAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity2)
        val view = LayoutInflater.from(this@PlayActivity2).inflate(R.layout.wrong_answer, null)
        builder.setView(view)
        val tvWrongDialogCorrectAns = view.findViewById<TextView>(R.id.tv_wrongDialog_correctAns)
        val wrongOk = view.findViewById<Button>(R.id.wrong_ok)
        tvWrongDialogCorrectAns.text = "جواب درست : " + answer[qIndex]
        val alertDialog = builder.create()
        wrongOk.setOnClickListener {
            timeLeftMilliSeconds =
                countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun timeOverAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity2)
        val view = LayoutInflater.from(this@PlayActivity2).inflate(R.layout.time_over, null)
        builder.setView(view)
        val timeOverOk = view.findViewById<Button>(R.id.timeOver_ok)
        val alertDialog = builder.create()
        timeOverOk.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }
}