package ir.aliyas.exm1


import android.annotation.SuppressLint
import android.content.Intent
import android.content.res.ColorStateList
import android.graphics.Color
import android.os.Bundle
import android.os.CountDownTimer
import android.view.LayoutInflater
import android.widget.*
import androidx.appcompat.app.AlertDialog
import androidx.appcompat.app.AppCompatActivity
import ir.aliyas.exm1.databinding.ActivityPlay3Binding
import ir.aliyas.exm1.databinding.ActivityPlayBinding
import java.util.*
import java.util.concurrent.TimeUnit


class PlayActivity3 : AppCompatActivity() {
    private lateinit var activityPlay3Binding: ActivityPlay3Binding

    //    timer
    private var countDownTimer: CountDownTimer? = null
    private val countDownInMilliSecond: Long = 60000
    private val countDownInterval: Long = 1000
    private var timeLeftMilliSeconds: Long = 0
    private var defaultColor: ColorStateList? = null
    private var score = 0
    private var correct = 0
    private var wrong = 0
    private var skip = 0
    private var qIndex = 0
    private var updateQueNo = 1


    // create string for question, answer and option

    var questions = arrayOf(
        "1- چند مورد از موارد زیر، میتواند ویژگی نوعی ساختار واجد قطعات غضروفی در شش های یک فرد سالم و بالغ باشد؟\n" +
                "الف: درانتهای خود، به دو ساختارلوله ای شکل با قطر و طول متفاوت ختم میشود.\n" +
                "ب: یاخته های پوششی دیوارۀآن،قادر به تبادل گازهای تنفسی با شبکۀ مویرگی اطراف هستند.\n" +
                "ج: در حداکثر فعالیت انقباضی ماهیچه های ناحیۀ شکم، درتماس با حجمی غیر مبادله ای قرار میگیرد.\n" +
                "د: تحت تأثیر ترشحات گروهی از یاخته های دیوارۀ حبابک، تغییراتی در روند افزایش قطر آن ایجاد میشود.",
        "2- در دستگاه گوارش انسان، اندام هایی که ضمن مشاهده شدن در هر دو سمت بدن، بخش عمدة آنها در یک سمت قرار دارد و\n" +
                "سلول های آنها میتوانند انواعی از آنزیم های مختلف را بسازند، به طور حتم دارای کدام مشخصة زیر هستند؟\n",
        "3- كدام مورد، دربارٔه جانوران مهره داري صادق است كه هر دو نوع خون موجود در قلب آنها، همراه با هم وارد رگي ميشـود كـه ابتـدا بـه دو\n" +
                "شاخه تقسيم ميگردد؟ ",
        "4- كدام عبارت، دربارٔه همۀ جانوراني درست است كه بين خون و مايع ميان بافتي آنها، جدايي وجود دارد؟",
        "5- کدام مورد از مولکول های زیر جزء متنوع ترین گروه مولکول های زیستی از نظر ساختار شیمیایی و عملکردی هستند؟",
        "6- در خصوص هورمون هایی که از اندام های لولۀ گوارش ترشح می شوند و فعالیت های دستگاه گوارش را تنظیم می کنند، کدام\n" +
                "عبارت نادرست است؟\n",
        "7- نوعی جانور بی مهره، میتواند اکسیژن را از طریق برجستگی های کوچک و پراکندۀ پوستی جذب کند، کدام مورد، در ارتباط\n" +
                "با این جانور، صحیح است؟",
        "8- کدام مورد، برای تکمیل عبارت زیر نامناسب است؟\n" +
                "< دریک انسان سالم و درتنفس آرام و طبیعی، به منظور.................. فاصلۀ میانبند از چشم، لازم .................. تا .................. >\nکدام مورد، برای تکمیل عبارت زیر نامناسب است؟\n",

        "9- در ارتباط با مخاط نای، کدام مورد صحیح است؟",
        "10-  به طور معمول و با توجه به مطالب كتاب درسي، در هر نوع ديابت كه در آن ميزان انسولين در خون طبيعي است، ............... ",
        "11- كدام گزينه براي تكميل عبارت زير مناسب است؟ \n" +
                " «بخش بالاروي لولۀ هنله ............... بخش پايين روي اين لوله، ............... » ",
        "12- كدام گزينه در رابطه با مجاري لنفي درست است؟ ",
        "13- كدام گزينه براي تكميل عبارت زير مناسب است؟ \n" +
                " «همۀ ............... .»",
        "14- ياختۀ دارينه اي ........",
        "15- نخستین پروتئینی که ساختار آن شناسایی شد، چه مشخصه ای دارد؟",
        "16- کدام گزینه، برای تکمیل عبارت زیر مناسب است؟\n" +
                "< به طورمعمول، ............. از مرحله ای از آزمایش.................. قابل انتظاراست.>\n",
        "17- چند مورد، عبارت زیر را به درستی کامل می کند؟\n" +
                "< فقط بعضی از....................>\n" +
                "الف(تومورهای خوشخیم، باعث آسیب به بافت های دوردست میشوند.\n" +
                "ب(یاخته های مالنوما،کنترل نقاط وارسی مربوط به چرخۀ یاخته ای را از دست داده اند.\n" +
                "ج(افرادی که تحت شیمی درمانی قرار می گیرند، نیازبه پیوند یاخته های بنیادی پیدا میکنند.\n" +
                "د(بافت هایی که تعادل بین تقسیم ومرگ یاخته هایشان را از دست داده اند، تومور تشکیل میدهند.\n",
        "18- در نخستین خط دفاعی، نوعی آنزیم برون  یاخته ای سبب مرگ برخی از  میکروب ها  میشود. این آنزیم فقط ..........",
        "19- کدام مورد، برای تکمیل عبارت زیر نامناسب است؟\n" +
                "< در بدن انسان، به منظور جلوگیری از خروج خون از دیوارۀرگی که باآسیب شدید مواجه شده است، لازم است تا...........، >\n",
        "20- كدام عبارت درست است؟",
        "21- دربارٔه هورمون تستوسترون كدام مورد نادرست است؟",
        "22- چند مورد، براي تكميل عبارت زير مناسب است؟ \n" +
                " «در مرگ برنامه ريزي شدٔه ياخته اي برخلاف بافت مردگي، ............... » \n" +
                " الف) پاسخ هاي التهابي رخ ميدهد. \n" +
                " ب) اثرات مثبتي براي بدن ايجاد ميشود. \n" +
                " ج) ابتدا تغييري در غشاي ياخته ايجاد ميشود. \n" +
                " د) ياخته به سبب فعاليت درشت خوارها ميميرد.",
        "23- كدام گزينه، وجه اشتراك يك ياختۀ پيكري انسان و درخت زيتون را به درستي بيان كرده است؟",
        "24- چند مورد جملۀ زير را به درستي تكميل ميكند؟ \n" +
                "< در طي يك دورٔه جنسي در يك فرد سالم، همزمان با ............... ،ميزان هورمون ............... >\n" +
                " الف) تشكيل جسم زرد-پروژسترون افزايش مييابد.\n" +
                " ب) تحليل جسم زرد-استروژن در حال كاهش است.\n" +
                " ج) رشد انبانك-استروژن افزايش مييابد.\n" +
                "د) شروع دورٔه جنسي-FSH افزايش پيدا ميكند.\n",
        "25- با توجه به مراحل توليد گامت در يك زن جوان، چند مورد عبارت زير را به طور مناسب كامل ميكند؟ \n" +
                " هر ياخته اي كه در مرحلۀ پروفاز ميوز 1 قرار دارد، قطعاً ............... \n" +
                " الف) در ابتداي يك چرخۀ جنسي بهوجود آمده است.\n" +
                " ب) توسط تعدادي ياخته پيكري احاطه شده است.\n" +
                "  ج) ياخته اي بسيار بزرگتر از اسپرم را به وجود مي آورد.\n" +
                "  د)در واكنش به حداكثر ميزان ترشح LH،تقسیم می شود\n",
        "26- كدام گزينه براي تكميل عبارت زير مناسب است؟ \n" +
                " «هورمون هايي كه بر دستگاه توليد مثل مردان مؤثر هستند و از هيپوفيز ترشح ميشوند، نمي توانند ............... » ",
        "27- كدام مورد نادرست است؟ \n" +
                " «در اسكلت بدن انسان، هر استخواني كه با لايۀ خارجي پردههاي مننژ در ارتباط است، قطعاً .............. » ",
        "28- به طور معمول و با توجه به مطالب كتاب درسي، در هر نوع ديابت كه در آن ميزان انسولين در خون طبيعي است، ...............",
        "29- كدام موارد، جملۀ زير را بهدرستي كامل مي نمايند؟ \n" +
                " «به طور طبيعي در انسان طي فرايند ............... » \n" +
                " الف) تراوش، مواد با فشار حاصل از انقباض بطن چپ به گرديزه (نفرون) وارد ميشوند. \n" +
                " ب) تراوش، مواد با عبور از ديواره هاي كپسول بومن وارد گرديزه ميشوند. \n" +
                " ج) ترشح، هر مادهاي كه وارد گرديزه مي شود از مويرگ هاي شبكۀ دور لولهاي خارج شده است. \n" +
                " د) باز جذب، ورود مواد به مويرگ از ياخته هاي داراي مژك آغاز ميگردد. ",
        "30- به طور معمول، كدام عبارت دربارٔه همۀ مهره داراني صادق است كه كارايي تنفس آنها نسبت به پستانداران افزايش يافته است؟"





        )
    private var answer = arrayOf(
        "2",
        "خون سیاهرگی آن، وارد سیاهرگ فوق کبدی میشود.",
        "برخلاف خزندگان، به كمك ساده ترين اندام تنفسي هم، به تبادلات گازي مي پردازند. ",
        "در ياخته هاي غير ماهيچه اي آنها نيز حركت به صورت هاي مختلف ديده ميشود.",
        "همۀ مولکول های تولید شونده در بدن انسان و فعال کنندۀ پروتئین های مکمل خوناب",
        " همۀ آنها، اثر یکسانی بر روی اسیدیتۀ خون اطراف اندام هدف خود دارند.",
        " مایعات بدن را از طریق کانال هایی در برجستگی ها به گردش درمی آورد.",
        "افزایش - نیست - ماهیچه های بین دنده ای خارجی منقبض شوند.",
        "یاخته های موجود در آن، با بخش حاوی مولکول های پروتئینی و گلیکوپروتئینی در تماس هستند.",
        "نوعي مركز عصبي در ساختار هيپوتالاموس تحريك مي شود.",
        "برخلاف- با بخش سرخرگي مويرگِ اطرافِ اين لوله مجاور است.",
        "مجراي لنفي چپ نسبت به مجراي لنفي راست طول بيشتري دارد.",
        "جانواران داراي نوعي سامانۀ گردش مواد هستند",
        "برخلاف ائوزينوفيل، توانايي فعال كردن لنفوسيت را دارد.",
        "برای نخستین بار پیوندهای هیدروژنی را در دومین سطح ساختاری بین آمینواسیدهای غیرمجاور شکل می دهد. ",
        " بعد - ایوری که پروتئین ها نخستین بار تخریب شدند، قرارگرفتن مواد زیستی در چندین لایه به دنبال سانتریفیوژ کردن آن",
        "2",
        "از یاخته های پوششی ترشح میشود.",
        "کم تعداد ترین اجزای بخش سنگین تر خون، با آزادکردن مواد نقش اصلی را در تشکیل لخته ایفا کنند.",
        "در مرحلۀ آنافاز ميتوز ياخته كشيده تر شده و عدد فام تني (كروموزومي) افزايش مي يابد.",
        "با تحريك FSH ترشح ميشود.",
        "1",
        "درون هسته، در ساختار انواع حالت هاي فام تني، پروتئين هايي يافت مي شوند.",
        "4",
        "1",
        "در زنان باعث افزايش ترشح شير شوند.",
        "در سطوح مفصلي خود فاقد بافت پيوندي غضروفي است.",
        "نوعي مركز عصبي در ساختار هيپوتالاموس تحريك ميشود.",
        "فقط الف",
        "با باز جذب زياد آب در كليه ها، فشار اسمزي مايعات بدن را تنظيم ميكنند."



    )
    private var options = arrayOf(
        "1",
        "2",
        "3",
        "4",
        "سیاهرگ باب کبدی، درون آن، دو انشعاب ایجاد می کند.",
        " نسبت به اندام های لولۀ گوارش، قوی ترین لیپاز را دارد.",
        "خون سیاهرگی آن، وارد سیاهرگ فوق کبدی میشود.",
        " نوعی مادة دخیل در گوارش فیزیکی را می سازد.",
        "همانند پرندگان، پيچيده ترين شكل كليه را دارند. ",
        "برخلاف خزندگان، ابتدايي ترين طناب عصبي شكمي را دارند. ",
        "برخلاف خزندگان، به كمك ساده ترين اندام تنفسي هم، به تبادلات گازي مي پردازند. ",
        "همانند پرندگان، نسبت به ساير مهره داران، انرژي بيشتري را به هنگام حركت مصرف مي كنند.",
        "شباهت اساسي در ساختار استخوان هاي آنها ديده ميشود.",
        "فراوان ترين ياخته هاي خوني در مغز استخوان آنها ساخته ميشود.",
        "در درون بدن آنها، بخش هاي ويژهاي براي تنفس تمايز يافته است.",
        "در ياخته هاي غير ماهيچه اي آنها نيز حركت به صورت هاي مختلف ديده ميشود.",
        "همۀ مولکول های انتقال دهندۀ یک پیام از یاخته ای به یاختۀ دیگر از طریق نوعی بافت پیوندی مایع\n",
        "اغلب گیرنده های آنتیژنی موجود در سطح غشای یاخته های خونی خط سوم دفاعی بدن انسان",
        " اغلب مولکول های امکان پذیر کنندۀ برخی واکنش های شیمیایی انجام ناپذیر در بدن انسان",
        "همۀ مولکول های تولید شونده در بدن انسان و فعال کنندۀ پروتئین های مکمل خوناب",
        " فقط بعضی از آنها، بر روی فقط یک نوع یاخته درون اندام هدف خود اثر می گذارند",
        "همۀ آنها، موجب افزایش تجزیۀ نوعی مولکول زیستی واجد نیتروژن می شوند",
        " فقط بعضی از آنها، سبب فعال شدن مولکول هایی در رودۀ باریک می شوند",
        " همۀ آنها، اثر یکسانی بر روی اسیدیتۀ خون اطراف اندام هدف خود دارند.",
        "پوست آن در تمام طول بدن، به یک رنگ دیده میشود.",
        " هر دو برجستگی مجاور، اندازۀ نابرابری با یکدیگر دارند.",
        "گازها برای تبادل، باید از چهار لایهٔ فسفولیپیدی گذر کنند.",
        " مایعات بدن را از طریق کانال هایی در برجستگی ها به گردش درمی آورد.",
        "کاهش - نیست - ماهیچه های شکمی منقبض شوند.",
        "کاهش - است - بخش عمدۀ سازندۀ شش ها از هوا خالی شود.\n",
        "افزایش - نیست - ماهیچه های بین دنده ای خارجی منقبض شوند.",
        "افزایش - است - دستوری از پایین ترین مرکز عصبی تنفس ارسال شود.",
        "زنش مژکهای آن، همواره به سمت پایین است.",
        "همانند لایه متصل به آن، دارای تعداد زیادی مژک است.",
        "تمام سلول های استوانه ای موجود در آن، دارای مژک هستند.\n",
        "یاخته های موجود در آن، با بخش حاوی مولکول های پروتئینی و گلیکوپروتئینی در تماس هستند.",
        " ميزان تجزيۀ ذخاير پروتئيني و چربي در بدن افزايش مييابد.",
        " ترشح نوعي پيك شيميايي با اختلال مواجه شده است. ",
        "نوعي مركز عصبي در ساختار هيپوتالاموس تحريك مي شود.",
        "ميزان بسيار زيادي ادرار رقيق از بدن خارج مي شود.",
        "برخلاف- بخش نازك طويلتري نسبت به بخش ضخيم خود دارد.",
        "همانند- موادي دارد كه هم جهت با جريان خون در مويرگ اطراف آنها در جريان هستند.",
        "برخلاف- با بخش سرخرگي مويرگِ اطرافِ اين لوله مجاور است.",
        "همانند- ادرار را به صورت يك طرفه از كنار شبكۀ مويرگي دوم عبور مي دهد.",
        "مجراي لنفي راست نسبت به مجراي لنفي چپ قطور تر است.",
        "مجراي لنفي چپ نسبت به مجراي لنفي راست طول بيشتري دارد.",
        "هر دو مجراي لنفي در يك فرد طبيعي از پشت قلب عبور مي كنند.",
        "هر دو مجراي لنفي به بزرگ سياهرگ زبرين متصل مي شوند.",
        "پستانداران داراي گويچه هاي قرمز بدون هسته هستند",
        "سرخرگ هاي بدن انسان در قسمت هاي عمقي هر اندام قرار گرفته است",
        "جانواران داراي نوعي سامانۀ گردش مواد هستند",
        "اندامك هاي گويچه هاي قرمز خون از بين رفته است",
        "برخلاف درشت خوار، پس از تراگذري ايجاد ميشود.",
        " همانند ماستوسيت، از بيگانه خوارهاي درون خون است.",
        "برخلاف ائوزينوفيل، توانايي فعال كردن لنفوسيت را دارد.",
        "همانند نوتروفيل، توانايي تراگذري دارد.",
        "در تارهای کند نسبت به تارهای تند، گروه های هم بیشتری در ساختار خود دارد.",
        "در پی قرارگیری زنجیره های پلیپپتیدی آن در کنار یکدیگر، به ساختار نهایی خود میرسد.",
        "در فرایند بلوغ گویچه های قرمز، به دنبال خروج هسته، حجم زیادی از سیتوپالسم را اشغال می کند.",
        "برای نخستین بار پیوندهای هیدروژنی را در دومین سطح ساختاری بین آمینواسیدهای غیرمجاور شکل می دهد. ",
        " بعد - ایوری که نتیجه گرفت عامل وراثتی یاخته دنا میباشد، انتقال آنزیم های تجزیه کننده، به محیط کشت باکتری واجد پوشینۀ زنده",
        " قبل - گریفیت که تنها از باکتری کشته شده تحت تأثیر گرما استفاده شد، رد شدن فرضیۀ پوشینه به عنوان تنها عامل مرگ موش ها",
        " بعد - ایوری که پروتئین ها نخستین بار تخریب شدند، قرارگرفتن مواد زیستی در چندین لایه به دنبال سانتریفیوژ کردن آن",
        "قبل - گریفیت که گونه های مختلفی از باکتری ها به موش تزریق شد، ادامه یافتن فعالیت تنفس هوازی موش",
        "1",
        "2",
        "3",
        "4",
        "بر روی عوامل انگلی اثر میکند.",
        "از یاخته های پوششی ترشح میشود.",
        "همراه با مایعی نمکی ترشح میشود.",
        "در محیط قلیایی میتواند به خوبی فعالیت کند.\n",
        "یاخته های آسیب دیده، آنزیم واکنش تشکیل مولکول های پروتئینی از پروترومبین را ترشح کنند.",
        "کم تعداد ترین اجزای بخش سنگین تر خون، با آزادکردن مواد نقش اصلی را در تشکیل لخته ایفا کنند.",
        " رشته هایی که در اثر تغییر یکی از پروتئین های پالسما ایجاد شدهاند، اجزای بخش یاخته ای خون را به دام میاندازد",
        "در حضور نوعی یون معدنی، دو نوع مولکول پروتئینی در خون ایجاد شوند که در حالت طبیعی در خون یافت نمی شوند.\n",
        "در بدن يك فرد سالم، ياخته اي با بيش از دو كروموزوم ۲۱ وجود ندارد.",
        "به هنگام سيتوكينز ياخته هاي گياهي، رشته هاي دوك كاملاً از بين رفته اند",
        "پوشش هستۀ ياخته ها تنها به هنگام تقسيم ميتوز يا ميوز ميتواند ناپديد شود.",
        "در مرحلۀ آنافاز ميتوز ياخته كشيده تر شده و عدد فام تني (كروموزومي) افزايش مي يابد.",
        " در بدن زنان نيز ترشح ميشود. ",
        "از ياخته هاي بينابيني ترشح ميشود.",
        "با ساز و كار بازخورد منفي تنظيم ميشود.",
        "با تحريك FSH ترشح ميشود.",
        "1",
        "2",
        "3",
        "4",
        "تعداد و اندازٔه فام تن هاي آنها يكسان اند.",
        "تركيبات تشكيل دهندٔه غشاي ياخته ايِ يكسان دارند.",
        "درون هسته، در ساختار انواع حالت هاي فام تني، پروتئين هايي يافت مي شوند.",
        "در ياخته هاي هر دو جنس نر و ماده، فامتن جنسي X وجود دارد. ",
        "1",
        "2",
        "3",
        "4",
        "1",
        "2",
        "3",
        "4",
        "بر ميزان هماتوكريت خون اثر بگذارند. ",
        "منجر به تحريك ياختههاي بيگانه خوار شوند.",
        "در زنان باعث افزايش ترشح شير شوند.",
        "اثري مشابه هورمون رشد داشته باشند. \n",
        "در سطوح مفصلي خود فاقد بافت پيوندي غضروفي است.",
        "فاقد توانايي تشكيل مفصل با استخوان هاي جانبي دراز است. ",
        "داراي بافت استخواني اسفنجي است كه به وسيلۀ بافت استخواني متراكم احاطه شدهاند.",
        "بخشي از اسكلت محوري بدن محسوب ميشود. ",
        "ميزان تجزيۀ ذخاير پروتئيني و چربي در بدن افزايش مييابد.",
        "ترشح نوعي پيك شيميايي با اختلال مواجه شده است.",
        "نوعي مركز عصبي در ساختار هيپوتالاموس تحريك ميشود.",
        " ميزان بسيار زيادي ادرار رقيق از بدن خارج ميشود. ",
        "فقط الف",
        "الف-ب",
        "الف- د",
        "ج- د",
        "در بخش حجيم انتهاي مري، مواد غذايي را ذخيره مي نمايند.",
        " نمك اضافي را از طريق غدد نمكي نزديك چشم يا زبان به بيرون مي رانند.",
        "با باز جذب زياد آب در كليه ها، فشار اسمزي مايعات بدن را تنظيم ميكنند.",
        "خون اكسيژن دار به يكباره به تمام مويرگ هاي اندام هاي آنها وارد ميشود."











        )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        activityPlay3Binding = ActivityPlay3Binding.inflate(layoutInflater)
        setContentView(activityPlay3Binding.root)
        setSupportActionBar(activityPlay3Binding.toolbarmain)
        initViews()
    }

    @SuppressLint("SetTextI18n")
    private fun showNextQuestion() {
        checkAnswer()
        activityPlay3Binding.apply {
            if (updateQueNo < 30) {
                tvNoOfQues.text = "${updateQueNo + 1}/30"
                updateQueNo++
            }
            if (qIndex <= questions.size - 1) {
                tvQuestion.text = questions[qIndex] as CharSequence?
                radioButton1.text = options[qIndex * 4] // 2*4=8
                radioButton2.text = options[qIndex * 4 + 1] //  2*4+1=9
                radioButton3.text = options[qIndex * 4 + 2] //  2*4+2=10
                radioButton4.text = options[qIndex * 4 + 3] //  2*4+3=11
            } else {
                score = correct
                val intent = Intent(this@PlayActivity3, ResultActivity3::class.java)
                intent.putExtra("درست", correct)
                intent.putExtra("نادرست", wrong)
                intent.putExtra("skip", skip)
                startActivity(intent)
                finish()
            }
            radiogrp.clearCheck()
        }
    }

    @SuppressLint("SetTextI18n")
    private fun checkAnswer() {
        activityPlay3Binding.apply {
            if (radiogrp.checkedRadioButtonId == -1) {
                skip++
                timeOverAlertDialog()
            } else {
                val checkRadioButton =
                    findViewById<RadioButton>(radiogrp.checkedRadioButtonId)
                val checkAnswer = checkRadioButton.text.toString()
                if (checkAnswer == answer[qIndex]) {
                    correct++
                    txtPlayScore.text = "امتیاز : $correct"
                    correctAlertDialog()
                    countDownTimer?.cancel()
                } else {
                    wrong++
                    wrongAlertDialog()
                    countDownTimer?.cancel()
                }
            }
            qIndex++
        }
    }

    @SuppressLint("SetTextI18n")
    private fun initViews() {
        activityPlay3Binding.apply {
            tvQuestion.text = questions[qIndex] as CharSequence?
            radioButton1.text = options[0]
            radioButton2.text = options[1]
            radioButton3.text = options[2]
            radioButton4.text = options[3]
            // check options selected or not
            // if selected then selected option correct or wrong
            nextQuestionBtn.setOnClickListener {
                if (radiogrp.checkedRadioButtonId == -1) {
                    Toast.makeText(
                        this@PlayActivity3,
                        "جوابی را انتخاب کنید",
                        Toast.LENGTH_SHORT
                    )
                        .show()
                } else {
                    showNextQuestion()
                }
            }
            tvNoOfQues.text = "$updateQueNo/30"
            // tvQuestion.setImageResource(0)
            //  tvQuestion.imageMatrix = questions[qIndex] as Matrix?
            tvQuestion.text = questions[qIndex] as CharSequence?
            defaultColor = quizTimer.textColors
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
        }
    }

    private fun statCountDownTimer() {
        countDownTimer = object : CountDownTimer(timeLeftMilliSeconds, countDownInterval) {
            override fun onTick(millisUntilFinished: Long) {
                activityPlay3Binding.apply {
                    timeLeftMilliSeconds = millisUntilFinished
                    val second = TimeUnit.MILLISECONDS.toSeconds(timeLeftMilliSeconds).toInt()
                    // %02d format the integer with 2 digit
                    val timer = String.format(Locale.getDefault(), "زمان: %02d", second)
                    quizTimer.text = timer
                    if (timeLeftMilliSeconds < 10000) {
                        quizTimer.setTextColor(Color.RED)
                    } else {
                        quizTimer.setTextColor(defaultColor)
                    }
                }
            }

            override fun onFinish() {
                showNextQuestion()
            }
        }.start()
    }

    @SuppressLint("SetTextI18n")
    private fun correctAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity3)
        val view = LayoutInflater.from(this@PlayActivity3).inflate(R.layout.correct_answer, null)
        builder.setView(view)
        val tvScore = view.findViewById<TextView>(R.id.tvDialog_score)
        val correctOkBtn = view.findViewById<Button>(R.id.correct_ok)
        tvScore.text = "امتیاز : $correct"
        val alertDialog = builder.create()
        correctOkBtn.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun wrongAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity3)
        val view = LayoutInflater.from(this@PlayActivity3).inflate(R.layout.wrong_answer, null)
        builder.setView(view)
        val tvWrongDialogCorrectAns = view.findViewById<TextView>(R.id.tv_wrongDialog_correctAns)
        val wrongOk = view.findViewById<Button>(R.id.wrong_ok)
        tvWrongDialogCorrectAns.text = "جواب درست : " + answer[qIndex]
        val alertDialog = builder.create()
        wrongOk.setOnClickListener {
            timeLeftMilliSeconds =
                countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun timeOverAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity3)
        val view = LayoutInflater.from(this@PlayActivity3).inflate(R.layout.time_over, null)
        builder.setView(view)
        val timeOverOk = view.findViewById<Button>(R.id.timeOver_ok)
        val alertDialog = builder.create()
        timeOverOk.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }
}