package ir.aliyas.exm1


import android.annotation.SuppressLint
import android.content.Intent
import android.content.res.ColorStateList
import android.graphics.Color
import android.os.Bundle
import android.os.CountDownTimer
import android.view.LayoutInflater
import android.widget.*
import androidx.appcompat.app.AlertDialog
import androidx.appcompat.app.AppCompatActivity
import ir.aliyas.exm1.databinding.ActivityPlayBinding
import java.util.*
import java.util.concurrent.TimeUnit


class PlayActivity : AppCompatActivity() {
   private lateinit var activityPlayBinding: ActivityPlayBinding

    //    timer
    private var countDownTimer: CountDownTimer? = null
    private val countDownInMilliSecond: Long = 60000
    private val countDownInterval: Long = 1000
    private var timeLeftMilliSeconds: Long = 0
    private var defaultColor: ColorStateList? = null
    private var score = 0
    private var correct = 0
    private var wrong = 0
    private var skip = 0
    private var qIndex = 0
    private var updateQueNo = 1



    // create string for question, answer and option

    var questions = arrayOf(
        "1- کدامیک از مطالب زیر نادرست است؟",
        "2-هرگاه در یک واکنش به حالت تعادل در دمای ثابت، غلظت یکی از ................ ها .................. یابد، واکنش در جهت ............... تا آنجا پیش می رود که \n" +
                "به ثابت تعادل ................... برسد.",
        "3- کدامیک از مطالب زیر در رابطه با مواد کوواالنسی درست است؟",
        "4- همه عبارتهای زیر درست هستند؛ بجز:",
        "5- کدام مورد، دربارة پیل سوختی هیدروژن – اکسیژن با غشای مبادلهکنندة پروتون، درست است؟",
        "6- به شرط یکسان بودن دما، سرعت تولید گاز هیدروژن در واکنش میان مواد موجود در کدام گزینه نسبت به سایر موارد کمتر است؟ ",
        "7- اگر به جای همة اتمهای هیدروژن مولکول بنزن، گروه متیل قرار گیرد، کدام مورد درست است؟",
        "8- کدام عبارت نادرست است؟",
        "9- در ساختار ،۲ ،۲ -۳ تریمتیل هگزان، چند پیوند کوواالنسی سادة کربن ـ کربن وجود دارد؟",
        "10- کدامیک از مطالب زیر درست است؟\n",
        "11- در فرمول شیمیایی کدامیک از ترکیبهای زیر، نسبت میان شمار اتمها به شمار عناصر در مقایسه با سایر ترکیبها بیشتر است؟\n",
        "12- کدام مطلب درست است؟ ",
        "13- کدام مطلب دربارة سلول گالوانی و سلول الکترولیتی درست است؟",
        "14- هرگاه یک مول الکل دو عاملی با یک مول کربوکسیلیک اسید دو عاملی واکنش دهد، فراوردۀ آلی حاصل، .",
        "15- اگر در یک واکنش گازی تعادلی در یک ظرف در بسته، با افزایش دمای سامانه یا اضافه کردن یک گاز بیاثر، درصد فراوردهها در مخلوط واکنش \n" +
                "افزایش یابد، کدام مطلب درست است؟",
        "16- اگر غلظت موالر یک نمونه محلول استیک اسید محلول (I)و یک نمونه محلول نیتریک اسید محلول (II)با دمای یکسان برابر باشد، کدام مطلب \n" +
                "درست است؟\n",
        "17- کدام مطلب زیر، نادرست است؟",
        "18- جمع جبری بار یون های نیترات، سیلیکات، فسفات و هیدروژن کربنات و عدد اکسایش اتم مرکزی آنها کدام است؟",
        "19- کدام مطلب درست است؟",
        "20- بر پایة مدل آرنیوس، کدام دو عنصر در واکنش با اکسیژن، اکسید اسیدی به وجود میآورند و اسید مربوط به اکسید کدام عنصر، هیدروژن اسیدی \n" +
                "بیشتری دارد؟",
        "21- کدام مطلب دربارة بنز آلدهید و -2 هپتانون، نادرست است؟",
        "کدام مطلب درست است؟ ",
        "22- کدام ماده در حالت مایع، انرژی گرمایی را بیشتر نگه میدارد؟ ",
        "23- ساختار فلزها، آرایش منظمی از کاتیونها در ................... بعد است که در فضای بین آنها، سستترین الکترونهای موجود در ،................... آزادانه \n" +
                "جابه جا میشوند. ",
        "24- در کدام گزینه، اتم کربن با عدد اکسایش بالتر وجود دارد؟",
        "25- کدام مطلب درست است؟ ",
        "25- ساختار مولکولی کدام ترکیب، فاقد پیوند سه گانه است؟ ",
        "26- کدام مطلب، دربارۀ تعادل های شیمیایی درست است؟\n",
        "27- در معادلۀ موازنه شدۀ سوختن گرد آهن در اکسیژن و تبدیل آن به آهن (III) اکسید، مجموع ضرایب استوکیومتری مواد کدام است و در مجموع، \n" +
                "چند مول الکترون بین گونههای اکسنده و کاهنده مبادله می شود؟",
        "28- با توجه به نقشه های پتانسیل الکترواستاتیکی پروپان و دی متیل اتر، کدام مطلب درست است؟",
        "29- همة عبارتهای زیر درست هستند- به جز ............. .",
        "30- گرافن یک جامد کووالنسی با ساختار .............. بوده و هر اتم کربن موجود در ساختار آن به ................ اتم کربن دیگر متصل شده است و نوع پیوندهای \n" +
                "تشکیل شده میان این ات مها به نوع پیوندهای میان اتم های کربن در ............... شبیه تر است."





        )
    private var answer = arrayOf(
        "محلول همگنی از نمکهای وانادیم (5) پرتوهای آبیرنگ را به خود جذب کرده و پرتوهای قرمز رنگ را بازتاب میکند.",
        "فراورده، کاهش، رفت، آغازی ",
        "گرافن یک گونهی شفاف و انعطافپذیر بوده و همانند الماس، یکی از آلوتروپهای کربن محسوب میشود.\n",
        "با استفاده از فلز نیکل در واکنش تبدیل هگزن به هگزان، مقدار تغییر آنتالپی این واکنش کاهش پیدا میکند",
        "جهت حرکت پروتونها در غشا، از آند به کاتد است.",
        "فلز آهن و محلول 1 موالر استیک اسید",
        "فرّاریت آن کاهش مییابد.",
        "آرایش الکترونی یونهای پایدار حاصل از همه ی عناصر موجود در دسته ی dاز تناوب چهارم به زیرلایه 3d ختم میشود",
        "8",
        "ذرات سازندهی اتانول، برخالف ذرات سازندهی سدیم کلرید، به هنگام انحالل در آب ویژگی ساختار خود را حفظ میکنند.",
        "آلومینیم سولفات ",
        "الکترون در حالت برانگیخته، ناپایدار است و با از دست دادن انرژی، همواره به حالت پایه باز نمیگردد",
        " در سلول گالوانی، قطب منفی آند و در سلول الکترولیتی قطب مثبت آند است و در هر دو سلول، کاتیونها به سمت کاتد میروند. ",
        "افزایش دما، سرعت واکنشهای گرماگیر و گرماده را افزایش میدهد.",
        "همچنان دارای گروههای عاملی هیدروکسیل و کربوکسیل خواهد بود.",
        "واکنش گرماگیر است و کاهش حجم سامانه تعادل را در جهت رفت جابهجا میکند.",
        "اگر دمای دو محلول به یک اندازه باالا رود، تفاوت غلظت یونهای موجود در دو محلول، کاهش پیدا میکند",
        "ساختار لوویس مولکولهای کربونیل سولفید و گوگرد دیاکسید مشابه هم است",
        "اثر فشار بر انحاللپذیری گاز نیتروژن، کمتر از گازهای اکسیژن و نیتروژن مونوکسید است.",
        "وارد کردن گاز کلر در محلول سدیم برمید",
        "ن یتروژن و گوگرد ـ گوگرد",
        "در مولکول هر دو، یکی از اتمهای کربن، عدد اکسایش +2 دارد.",
        "اگر واکنش فلز روی با اکسید فلز X انجام پذیر باشد، واکنش فلز پتاسیم با اکسید فلز X نیز به یقین انجام پذیر است. ",
        "پتاسیم کلرید",
        " سه ـ اتمهای فلز",
        "متیل استات",
        "شو ینده های خورنده، واکنشدهنده ها ی نامحلول را به فراورده های محلول در آب تبدیل میکنند. ",
        "O2",
        "اگر با افزایش دما، ثابت تعادل واکنش بزرگتر شود، آن واکنش گرماگیر است.",
        "12,9",
        "تبدیل پروپان به مایع، دشوارتر است.",
        "انرزی لازم برای فروپاشی شبکه یک مول کلسیم برمید بیشتر از انرزی لازم برای فروپاشی شبکه یک مول منیزیم کلرید است",
        " دو بعدی ـ ۳ ـ بنزن"


    )
    private var options = arrayOf(
        "فلزها در هر چهار دستۀ s، p، d و f قرار داشته و تمدنهای آغازی بشر نیز براساس گسترۀ کاربری آنها نامگذاری شدهاند",
        "سیلیس، یک جامد کوواالنسی بوده و در ساختار آن، هر اتم سیلیسیم توسط چهار پیوند اشتراکی به ۴ اتم اکسیژن متصل است.",
        "رسانایی الکتریکی و شکل پذیری، ازجمله رفتارهای فیزیکی فلزها هستند که با توجه به مدل دریای الکترونی توجیه میشوند.",
        "محلول همگنی از نمکهای وانادیم (5) پرتوهای آبیرنگ را به خود جذب کرده و پرتوهای قرمز رنگ را بازتاب میکند.",
        "فراورده، کاهش، رفت، آغازی",
        "فراورده، کاهش، برگشت، جدید",
        "واکنشدهنده، کاهش، رفت، جدید",
        " واکنشدهنده، افزایش، برگشت، آغازی",
        " همه ی مواد موجود در این گروه، همانند سدیم کلرید، در حالت جامد جریان الکتریسیته را عبور نمیدهند.",
        "چگالی الماس بیشتر از چگالی گرافیت بوده و نقطه ی ذوب آن در مقایسه با سیلیسیم خالص پایینتر است.",
        "گرافن یک گونهی شفاف و انعطافپذیر بوده و همانند الماس، یکی از آلوتروپهای کربن محسوب میشود.\n",
        "سیلیسیم فراوانترین عنصر موجود در پوسته جامد زمین بوده و همانند سرب، در گروه چهاردهم قرار دارد.",
        "با استفاده از فلز نیکل در واکنش تبدیل هگزن به هگزان، مقدار تغییر آنتالپی این واکنش کاهش پیدا میکند",
        " پارازایلن، یکی از اجزای سازنده ی نفت خام بوده و در هر مولکول آن 21 پیوند اشتراکی بین اتمها وجود دارد.",
        "گاز اتن در اثر واکنش با محلول آبی و رقیق پتاسیم پرمنگنات در شرایط مناسب به اتیلن گلیکول تبدیل میشود. ",
        " برای تهیه کربن مونوکسید و هیدروژن مورد نیاز برای تولید متانول، از واکنش میان گاز متان با بخار آب استفاده میشود.",
        " بخار آب تولید شده از بخش آندی خارج میشود.",
        " جهت حرکت پروتونها در غشا، از آند به کاتد است. ",
        " به ازای مصرف هر مول گاز اکسیژن، دو مول پروتون در غشا، مبادله میشود.",
        "جهت حرکت الکترونها در مدار بیرونی با جهت حرکت پروتونها در غشا، عکس یکدیگر است. ",
        " فلز آهن و محلول 1 موالر نیترو اسید ",
        "فلز روی و محلول 1 موالر استیک اسید",
        "فلز روی و محلول 1 موالر نیترو اسید",
        " فلز آهن و محلول 1 موالر استیک اسید ",
        "فرّاریت آن کاهش مییابد.",
        "خاصیت آروماتیکی آن، از بین میرود.",
        "فرمول مولکولی آن، مانند فرمول مولکولی نفتالن میشود. ",
        "گشتاور دوقطبی مولکول، افزایش چشمگیری پیدا میکند. ",
        "در فرایند جوش کاربیدی، از سوختن سادهترین عضو خانودهی آلکینها، برای جوش دادن قطعههای فلزی استفاده میشود.",
        "در طول سالهای اخیر، میزان استخراج و مصرف مواد معدنی، همانند عناصر فلزی و سوختهای فسیلی افزایش یافته است.\n",
        "بنزین یک محلول غیرآبی بوده و به ازای سوختن هر گرم از آن در مقایسه با هر گرم زغال سنگ، انرژی بیشتری آزاد میشود.",
        "آرایش الکترونی یونهای پایدار حاصل از همه ی عناصر موجود در دسته ی dاز تناوب چهارم به زیرلایه 3d ختم میشود",
        "6",
        "7",
        "8",
        "9",
        " در شرایط یکسان از نظر دما و فشار محیط، انحاللپذیری گاز اکسیژن در آب کمتر از انحاللپذیری گاز نیتروژن است.",
        "ذرات سازندهی اتانول، برخالف ذرات سازندهی سدیم کلرید، به هنگام انحالل در آب ویژگی ساختار خود را حفظ میکنند.",
        "یون نیترات، یکی از یون های موجود در آب آشامیدنی بوده و بار منفی آن فقط متعلق به یکی از اتمهای O موجود در آن است",
        "مولکولهای کربن دیاکسید، همانند مولکولهای آب و H2S، قطبی بوده و توسط یک میله شیشهای باردار جذب خواهند شد.\n,",
        "آلومینیم سولفات",
        "آهن((2)نیترات",
        " کلسیم هیدروکسید ",
        "مس (2)سیلیکات",
        "با دور شدن الکترون از هسته، انرژی آن کاهش مییابد. ",
        "در همة اتمها، تراز انرژی 1= n ، حالت پایه به شمار میآید.\n",
        "در طیف نشری خطی اتم هیدروژن، کمترین مقدار انرژی به نوار زردرنگ مربوط است. ",
        "الکترون در حالت برانگیخته، ناپایدار است و با از دست دادن انرژی، همواره به حالت پایه باز نمیگردد",
        "در سلول گالوانی، الکترود آند، قطب مثبت است. ",
        "در سلول الکترولیتی، قطب منفی و در سلول گالوانی، آند محل تشکیل اتم از یون است. ",
        "در سلول الکترولیتی، در قطب منفی، اکسایش انجام شده و از جرم تیغة فلزی کاسته میشود. ",
        " در سلول گالوانی، قطب منفی آند و در سلول الکترولیتی قطب مثبت آند است و در هر دو سلول، کاتیونها به سمت کاتد میروند. ",
        "افزایش دما، سرعت واکنشهای گرماگیر و گرماده را افزایش میدهد. ",
        "واکنش گاز هیدروژن با اکسیژن، گرماده و در مجاورت گرد روی، انفجاری است. ",
        "واکنشهای حذف آالینده های اگزوز خودروها، در دماهای پایین گرماده و سریعاند",
        "با کاربرد کاتالیزگر، میتوان Ea را به اندازهای کاهش داد که واکنش گرماگیر به گرماده تبدیل شود. ",
        "دارای دو گروه عاملی استری خواهد شد",
        "تمایلی به واکنش با الکل یا کربوکسیلیک اسید دیگر، نخواهد داشت. ",
        "همچنان دارای گروههای عاملی هیدروکسیل و کربوکسیل خواهد بود.",
        "در حاللهای قطبی، انحاللپذیری بیشتری نسبت به اجزای سازندۀ خود، خواهد داشت.",
        "واکنش گرماده و شمار مول های فراورده ها، کمتر از شمار مولهای واکنشدهنده ها است",
        "واکنش گرماگیر است و کاهش حجم سامانه تعادل را در جهت رفت جابهجا میکند",
        "واکنش گرماگیر و تغییر حجم سامانه بر جابهجایی تعادل، بیتأثیر است. ",
        "واکنش گرماده است و کاهش فشار، دمای سامانه را افزایش میدهد. ",
        "غلظت یونها و مولکولها در محلول I ، بیشتر از غلظت آنها در محلول II است. ",
        "با افزایش دمای دو محلول به یک اندازه، pH دو محلول نیز به یک اندازه تغییر میکند. ",
        "اگر دمای دو محلول به یک اندازه باالا رود، تفاوت غلظت یونهای موجود در دو محلول، کاهش پیدا میکند",
        "اگر غلظت اسید در یکی از محلولها افزایش یابد، ثابت تعادل و درصد یونش دو محلول به یکدیگر نزدیکتر میشود.",
        "ساختار لوویس مولکولهای کربونیل سولفید و گوگرد دیاکسید مشابه هم است.\n",
        " شمار جفت الکترونهای پیوندی در مولکولهای CH2O و HCN برابر است. ",
        "در مولکول کربن تتراکلرید همة اتمها از قاعدة هشتایی پیروی میکنند و شمار جفت الکترونهای ناپیوندی، سه برابر شمار پیوندها است.",
        "مجموع شمار اتمها در فرمول شیمیایی دینیتروژن تریاکسید با مجموع شمار یونها در فرمول شیمیایی آهن (III) اکسید، برابر است.",
        "اثر فشار بر انحاللپذیری گاز نیتروژن، کمتر از گازهای اکسیژن و نیتروژن مونوکسید است.",
        "دستگاه اندازهگیری قند خون )گلوکومتر(، میلیگرم گلوکز را در یک لیتر از خون نشان میدهد.",
        "در شرایط یکسان، گاز اتان آسانتر از گاز پروپان به مایع تبدیل میشود.",
        "مولکولهای استون و اتیلن گلیکول هر دو قطبی اند و نوع جاذبءه بین مولکولی آنها مشابه است.\n",
        " ریختن محلول هیدروکلریک اسید روی یک صفحة مسی ",
        "وارد کردن یک میلة آهنی در محلول پتاسیم نیترات ",
        "ریختن گرد روی در محلول نقره سولفات ",
        "وارد کردن گاز کلر در محلول سدیم برمید",
        "ن یتروژن و گوگرد ـ گوگرد ",
        "یتروژن و با ریم ـ باریم ",
        "کربن و کلسیم ـ کربن ",
        "کربن و فسفر ـ کربن",
        "هر دو دارای گروه عاملی کربونیل اند. ",
        "شماره اتمهای کربن سازندة مولکول آنها برابر است. ",
        "در مولکول هر دو، یکی از اتمهای کربن، عدد اکسایش +2 دارد.",
        "هر دو در میدان الکتریکی جهت گیری میکنند، اما انحالل پذیری آنها در آب، کم است.",
        "حاللیت یک ترکیب یونی در آب، به ماهیت یون فلزی آن بستگی دارد. ",
        "ستفاده از فلزهای آهن، روی و نقره میتواند رنگ محلول مس (II) سولفات را تغییر دهد. ",
        "با اضافه کردن محلول سدیم هیدروکسید ۱ موالر به FeCl3 محلول آجری رنگ تشکیل میشود. ",
        "اگر واکنش فلز روی با اکسید فلز X انجام پذیر باشد، واکنش فلز پتاسیم با اکسید فلز X نیز به یقین انجام پذیر است. ",
        "پتاسیم کلرید",
        "آب ",
        " نیتروژن ",
        "هیدروژن فلوور ید",
        "دو ـ کاتیونها ",
        " دو ـ اتم های فلز",
        " سه ـ اتمهای فلز",
        " سه ـ کاتیونها",
        "-2 پنتانون",
        "اتیلن گلیکول",
        " بنزآلدهید",
        "متیل استات",
        " پاک کنندههای غیر صابون ی، ترکیبهای سیرشده به شمار میآیند. ",
        "صابونهای فسفات دار، قدرت ضدعفونی کنندگی ب یشتری در مقایسه با صابون های معمولی دارند. ",
        "قدرت پاک کنندگی صابون، به میزان توانایی آن در انجام واکنش شیمیایی با آلیندههای موجود در محیط بستگی دارد",
        "شو ینده های خورنده، واکنشدهندهها ی نامحلول را به فراورده های محلول در آب تبدیل میکنند. ",
        "O2",
        "CO",
        "HCN",
        "N2",
        " اگر با افزایش دما، ثابت تعادل واکنش بزرگتر شود، آن واکنش گرماگیر است.",
        " در دمای ثابت، تغییر شرایط غلظت، فشار،حجم بر میزان پیشرفت واکنش تعادلی بی تاثیر است",
        " افزایش غلظت واکنش دهنده ها و کاهش غلظت فراورده ها در دمای ثابت، ثابت تعادل را افزایش میدهد.",
        "بر پایة اصل لوشاتلیه، وارد کردن گاز بی اثر به مخلوط واکنش، تعادل را جابه جا کرده، و ثابت تعادل را تغییر میدهد.",
        "3,7",
        "12,7",
        "3.9",
        "12,9",
        "تبدیل پروپان به مایع، دشوارتر است.",
        " در هر دو، اتم مرکزی بار جزیی مثبت دارد.\n",
        "نقشه های پتانسیل الکتروستاتیکی مشابهی دارند.",
        " هر دو در میدان الکتریکی به یکسو جهت گیری میکنند.",
        "با گرفتن یک میله بار دار در مجاورت باریکه های از کلروفرم مای، باریکه مورد نظر به سمت میله ی بار دار منحرف میشود.",
        "انرزی لازم برای فروپاشی شبکه یک مول کلسیم برمید بیشتر از انرزی لازم برای فروپاشی شبکه یک مول منیزیم کلرید است",
        " در نیروگاه های حرارتی، انری خورشید توسط شاره یونی جذب شده و پس از آن، به یک شاره مولکولی انتقال پیدا میکند",
        "در نقشه پتانسیل الکترواستاتیکی SO3 برخلاف نقشه پتانسیل الکترواستاتیکی آمونیاک، اتم مرکزی با رنگ آبی نشان داده میشود.",
        " دو بعدی ـ ۳ ـ بنزن",
        "سه بعدی ـ۴ ـ سیکلوهگزان",
        "سه بعدی ـ ۴ ـ بنزن",
        "دو بعدی ـ ۳ ـ سیکلوهگزان "






    )

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        activityPlayBinding = ActivityPlayBinding.inflate(layoutInflater)
        setContentView(activityPlayBinding.root)
        setSupportActionBar(activityPlayBinding.toolbarmain)
        initViews()
    }

    @SuppressLint("SetTextI18n")
    private fun showNextQuestion() {
        checkAnswer()
        activityPlayBinding.apply {
            if (updateQueNo < 30) {
                tvNoOfQues.text = "${updateQueNo + 1}/30"
                updateQueNo++
            }
            if (qIndex <= questions.size - 1) {
                tvQuestion.text = questions[qIndex] as CharSequence?
                radioButton1.text = options[qIndex * 4] // 2*4=8
                radioButton2.text = options[qIndex * 4 + 1] //  2*4+1=9
                radioButton3.text = options[qIndex * 4 + 2] //  2*4+2=10
                radioButton4.text = options[qIndex * 4 + 3] //  2*4+3=11
            } else {
                score = correct
                val intent = Intent(this@PlayActivity, ResultActivity::class.java)
                intent.putExtra("درست", correct)
                intent.putExtra("نادرست", wrong)
                intent.putExtra("skip", skip)
                startActivity(intent)
                finish()
            }
            radiogrp.clearCheck()
        }
    }

    @SuppressLint("SetTextI18n")
    private fun checkAnswer() {
        activityPlayBinding.apply {
            if (radiogrp.checkedRadioButtonId == -1) {
                skip++
                timeOverAlertDialog()
            } else {
                val checkRadioButton =
                    findViewById<RadioButton>(radiogrp.checkedRadioButtonId)
                val checkAnswer = checkRadioButton.text.toString()
                if (checkAnswer == answer[qIndex]) {
                    correct++
                    txtPlayScore.text = "امتیاز : $correct"
                    correctAlertDialog()
                    countDownTimer?.cancel()
                } else {
                    wrong++
                    wrongAlertDialog()
                    countDownTimer?.cancel()
                }
            }
            qIndex++
        }
    }

    @SuppressLint("SetTextI18n")
    private fun initViews() {
        activityPlayBinding.apply {
            tvQuestion.text = questions[qIndex] as CharSequence?
            radioButton1.text = options[0]
            radioButton2.text = options[1]
            radioButton3.text = options[2]
            radioButton4.text = options[3]
            // check options selected or not
            // if selected then selected option correct or wrong
            nextQuestionBtn.setOnClickListener {
                if (radiogrp.checkedRadioButtonId == -1) {
                    Toast.makeText(
                        this@PlayActivity,
                        "جوابی را انتخاب کنید",
                        Toast.LENGTH_SHORT
                    )
                        .show()
                } else {
                    showNextQuestion()
                }
            }
            tvNoOfQues.text = "$updateQueNo/30"
            // tvQuestion.setImageResource(0)
            //  tvQuestion.imageMatrix = questions[qIndex] as Matrix?
            tvQuestion.text = questions[qIndex] as CharSequence?
            defaultColor = quizTimer.textColors
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
        }
    }

    private fun statCountDownTimer() {
        countDownTimer = object : CountDownTimer(timeLeftMilliSeconds, countDownInterval) {
            override fun onTick(millisUntilFinished: Long) {
                activityPlayBinding.apply {
                    timeLeftMilliSeconds = millisUntilFinished
                    val second = TimeUnit.MILLISECONDS.toSeconds(timeLeftMilliSeconds).toInt()
                    // %02d format the integer with 2 digit
                    val timer = String.format(Locale.getDefault(), "زمان: %02d", second)
                    quizTimer.text = timer
                    if (timeLeftMilliSeconds < 10000) {
                        quizTimer.setTextColor(Color.RED)
                    } else {
                        quizTimer.setTextColor(defaultColor)
                    }
                }
            }

            override fun onFinish() {
                showNextQuestion()
            }
        }.start()
    }

    @SuppressLint("SetTextI18n")
    private fun correctAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity)
        val view = LayoutInflater.from(this@PlayActivity).inflate(R.layout.correct_answer, null)
        builder.setView(view)
        val tvScore = view.findViewById<TextView>(R.id.tvDialog_score)
        val correctOkBtn = view.findViewById<Button>(R.id.correct_ok)
        tvScore.text = "امتیاز : $correct"
        val alertDialog = builder.create()
        correctOkBtn.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun wrongAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity)
        val view = LayoutInflater.from(this@PlayActivity).inflate(R.layout.wrong_answer, null)
        builder.setView(view)
        val tvWrongDialogCorrectAns = view.findViewById<TextView>(R.id.tv_wrongDialog_correctAns)
        val wrongOk = view.findViewById<Button>(R.id.wrong_ok)
        tvWrongDialogCorrectAns.text = "جواب درست : " + answer[qIndex]
        val alertDialog = builder.create()
        wrongOk.setOnClickListener {
            timeLeftMilliSeconds =
                countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }

    @SuppressLint("SetTextI18n")
    private fun timeOverAlertDialog() {
        val builder = AlertDialog.Builder(this@PlayActivity)
        val view = LayoutInflater.from(this@PlayActivity).inflate(R.layout.time_over, null)
        builder.setView(view)
        val timeOverOk = view.findViewById<Button>(R.id.timeOver_ok)
        val alertDialog = builder.create()
        timeOverOk.setOnClickListener {
            timeLeftMilliSeconds = countDownInMilliSecond
            statCountDownTimer()
            alertDialog.dismiss()
        }
        alertDialog.show()
    }
}